#1. შექმენით ფუნქცია, რომელიც არგუმენტად იღებს რიცხვს და აბრუნებს მის კვადრატს.
#2. შექმენით ფუნქცია, რომელიც არგუმენტად იღებს ორ რიცხვს და აბრუნებს მათ ჯამს.
#3. შექმენით ფუნქცია, რომელიც არგუმენტად იღებს რიცხვთა სიას და აბრუნებს ყველაზე პატარას.
#4. შექმენით ფუნქცია, რომელიც არგუმენტად იღებს რიცხვს და ამოწმებს, არის თუ არა ის დადებითი.
#5. შექმენით ფუნქცია, რომელიც არგუმენტად იღებს რიცხვთა სიას და აბრუნებს მათ ჯამს.

#1.
def square(n: int) -> int:
    return n ** 2

#2.
def sum_two_numbers(a: int, b: int) -> int:
    return a + b

#3.
def min_in_list(numbers: list) -> int:
    return min(numbers)

#4.
def is_positive(n: int) -> bool:
    return n > 0

#5.
def sum_of_list(numbers: list) -> int:
    return sum(numbers)
