#1. შექმენით 3 სხვადასხვა list-ი, თითოში დაამატეთ 5 რიცხვი და დაპრინტეთ ამ list-იდან მაქსიმალური რიცხვი.
#2. შექმენით 3 სხვადასხვა list-ი, თითოში დაამატეთ 5 რიცხვი და დაპრინტეთ ამ list-იდან მინიმალური რიცხვი.
#3. შექმენით 3 სხვადასხვა list-ი, თითოში დაამატეთ მინიმუმ 5 ელემენტი და დაპრინტეთ ამ list-ის სიგრძე.
#4. შექმენით 3 სხვადასხვა list-ი, თითოში დაამატეთ 5 რიცხვი და დაპრინტეთ ამ list-იდან რიცხვების ჯამი.
#5. შექმენით 4 სხვადასხვა list-ი, თითოში დაამატეთ მინიმუმ 10 ელემენტი
#და დაპრინტეთ:
# 1) პირველ list-ის პირველიდან მეოთხე ელემენტამდე ცვლადები.
# 2) მეორე list-ის მეოთხედან მერვე ელემენტამდე ცვლადები ფორ ციკლის          გამოყენებით.
# 3) მესამე list-ის მეცხრედან მეექვსე ელემენტამდე ცვლადები გაითვალისწინეთ არა 6დან 9მდე არამედ 9დან 6მდე გამოიყენეთ უარყოფითი რიცხვები.
# 4) მეოთხე list-ში დაპრინტეთ მისი ყველა ცვლადი while ცოკლის გამოყენებით.

#(boss level);
#6. შექმენით def ფუნქცია რომელიც არგუმენტად აიღებს list-ს რომელშიც მომხმარებელი შეიყვანს მინიმუმ 5 რიცხვს და დაპრინტავს ამ list-ის მაქსიმალურ რიცხვს, მინიმალურ რიცხვს, რიცხვების ჯამს და list-ის სიგრძეს.

#1.
list = [5, 7, 3, 8, 9]

print(list[4])

#2.
list = [5, 7, 3, 8, 9]

print(list[0])

#3.
list = ["books","water","homework","phone","camera"]

print(list)

#4.
list = [5 + 7 + 3 + 8 + 9]

list2 = [6 + 3 + 7 + 3 + 1]

list3 = [7 + 3 + 2 + 8 + 1]

print(list + list2 + list3)

#5.
list = ["books","water","homework","phone","camera", "toilet", "sink", "keyboard", "mouse", "bed"]
list2 = ["ligt", "lava", "cactus", "phonecase", "mousepad", "lamp", "lamb", "speakers", "table", "classwork"]
list3 = ["draw", "earplugs", "door", "bookshelf", "window", "balcony", "python", "pillow", "blanket", "game"]
list4 = ["wall", "roof", "glass", "desert", "food", "floor", "ground", "sound", "pound", "show"]

print(list[0:4])
print(list2[3:8])
print(list3[-5:-2])
print(list4)